<?php 
define('TOP_LIMIT1', 100); //верхний предел задания 1
define('LOW_LIMIT1', 0); // Нижний предел задания 1
define('LOW_LIMIT2', 0); // Нижний предел задания 2
define('TOP_LIMIT2', 10); // Верхний предел задания 2
const DIVIDER1 = 3; // делитель задания 1
const WORD = "Фывапр 23dg аРуюянг"; //строка для транслита
const WORDS = 'Весело весело встретим новый год'; //Предложение для задания 5

//Задание 1. Вывести числа от 0 до 100, делящиеся на 3 без остатка (1* - можно задавать другие значения через константу)

$i = LOW_LIMIT1;
while ($i <= TOP_LIMIT1){
    if ($i % DIVIDER1 == 0) echo $i .' ';
    $i++;
}
echo PHP_EOL;

//Задание 2. Числа от 0 до 10 с указанием четности

function odd($lowLimit, $topLimit2){
do{
    if($lowLimit == 0){
        echo "{$lowLimit} - ноль.".PHP_EOL;
      }
     elseif($lowLimit %2 == 0){
        echo "{$lowLimit} - четное число.".PHP_EOL;
    }
    else  echo "{$lowLimit} - нечетное число.".PHP_EOL;
$lowLimit++;
} while ($lowLimit <= $topLimit2);
}
odd(LOW_LIMIT2, TOP_LIMIT2);

// Задание 3. Области с городами, цикл из массива

$RegionArr = [];
$RegionArr['Амурская'] = ['Благовещенск', 'Тында', 'Зея'];
$RegionArr['Архангельская'] = ['Архангельск', 'Северодвинск', 'Котлас'];
$RegionArr['Астраханская'] = ['Астрахань', 'Камызяк', 'Ахтубинск'];
$RegionArr['Белгородская'] = ['Белгород', 'Губкин', 'Старый Оскол'];
$RegionArr['Брянская'] = ['Брянск', 'Клинцы', 'Унеча'];
$RegionArr['Владимирская'] = ['Владимир', 'Ковров', 'Гусь-Хрустальный'];
$RegionArr['Волгоградская'] = ['Волгоград', 'Камышин', 'Урюпинск'];
$RegionArr['Вологодская'] = ['Вологда', 'Череповец', 'Великий Устюг'];
$RegionArr['Воронежская'] = ['Воронеж', 'Лиски', 'Нововоронеж'];
$RegionArr['Ивановская'] = ['Иваново', 'Шуя', 'Тейково'];
$RegionArr['Иркутская'] = ['Иркутск', 'Братск', 'Ангарск'];
$RegionArr['Калининградская'] = ['Калининград', 'Советск', 'Светлый'];
$RegionArr['Калужская'] = ['Калуга', 'Обнинск', 'Киров'];
$RegionArr['Кемеровская'] = ['Кемерово', 'Новокузнецк', 'Анжеро-Судженск'];
$RegionArr['Кировская'] = ['Киров', 'Кирово-Чепецк', 'Котельнич'];
$RegionArr['Костромская'] = ['Кострома', 'Шарья', 'Галич'];
$RegionArr['Курганская'] = ['Курган', 'Шадринск', 'Куртамыш'];
$RegionArr['Курская'] = ['Курск', 'Железногорск', 'Курчатов'];
$RegionArr['Ленинградская'] = ['Санкт-Петербург', 'Гатчина', 'Выборг'];
$RegionArr['Липецкая'] = ['Липецк', 'Елец', 'Грязи'];
$RegionArr['Магаданская'] = ['Магадан', 'Ола', 'Сусуман'];
$RegionArr['Московская'] = ['Дмитров', 'Клин', 'Серпухов'];
$RegionArr['Мурманская'] = ['Мурманск', 'Апатиты', 'Гаджиево'];
$RegionArr['Нижегородская'] = ['Нижний Новгород', 'Дзержинск', 'Арзамас'];
$RegionArr['Новгородская'] = ['Великий Новгород', 'Боровичи', 'Старая Русса'];
$RegionArr['Новосибирская'] = ['Новосибирск', 'Барабинск', 'Куйбышев'];
$RegionArr['Омская'] = ['Омск', 'Тара', 'Калачинск'];
$RegionArr['Оренбургская'] = ['Оренбург', 'Орск', 'Новотроицк'];
$RegionArr['Орловская'] = ['Орёл', 'Мценск', 'Ливны'];
$RegionArr['Пензенская'] = ['Пенза', 'Кузнецк', 'Мокшан'];
$RegionArr['Псковская'] = ['Псков', 'Великие Луки', 'Печоры'];
$RegionArr['Ростовская'] = ['Ростов-на-Дону', 'Азов', 'Таганрог'];
$RegionArr['Рязанская'] = ['Рязань', 'Сасово', 'Касимов'];
$RegionArr['Самарская'] = ['Самара', 'Жигулёвск', 'Сызрань'];
$RegionArr['Саратовская'] = ['Саратов', '"Энгельс', 'Балаково'];
$RegionArr['Сахалинская'] = ['Южно-Сахалинск', 'Холмск', 'Корсаков'];
$RegionArr['Свердловская'] = ['Екатеринбург', 'Нижний Тагил', 'Качканар'];
$RegionArr['Смоленская'] = ['Смоленск', 'Вязьма', 'Ельня'];
$RegionArr['Тамбовская'] = ['Тамбов', 'моршанск', 'Котовск'];
$RegionArr['Тверская'] = ['Тверь', 'Ржев', 'Вышний Волочёк'];
$RegionArr['Томская'] = ['Томск', 'Северск', 'Стрежевой'];
$RegionArr['Тульская'] = ['Тула', 'Белёв', 'Алексин'];
$RegionArr['Тюменская'] = ['Тюмень', 'Сургут', 'Нижневартовск'];
$RegionArr['Ульяновская'] = ['Ульяновск', 'Димитровград', 'Новоульяновск'];
$RegionArr['Челябинская'] = ['Челябинск', 'Магнитогорск', 'Миасс'];
$RegionArr['Ярославская'] = ['Ярославль', 'Углич', 'Мышкин'];

foreach($RegionArr as $Region => $Towns){
    echo "{$Region} область:".PHP_EOL;
    echo implode(", ", $Towns).".".PHP_EOL;
}
//Задание 4. Массив русские-латинские. Сделать функцию транслитерации

$ABC = [
'а' => 'a',
'б' => 'b',
'в' => 'v',
'г' => 'g',
'д' => 'd',
'е' => 'e',
'ё' => 'io',
'ж' => 'zh',
'з' => 'z',
'и' => 'i',
'й' => 'y',
'л' => 'l',
'м' => 'm',
'н' => 'n',
'о' => 'o',
'п' => 'p',
'р' => 'r',
'с' => 's',
'т' => 't',
'у' => 'u',
'ф' => 'f',
'х' => 'kh',
'ц' => 'ts',
'ч' => 'ch',
'ш' => 'sh',
'щ' => 'stch',
'ъ' => 'j',
'ы' => 'i',
'ь' => '',
'э' => 'e',
'ю' => 'yu',
'я' => 'ya',
'А' => 'A',
'Б' => 'B',
'В' => 'V',
'Г' => 'G',
'Д' => 'D',
'Е' => 'E',
'Ё' => 'Io',
'Ж' => 'Zh',
'З' => 'Z',
'И' => 'I',
'Й' => 'Y',
'К' => 'K',
'Л' => 'L',
'М' => 'M',
'Н' => 'N',
'О' => 'O',
'П' => 'P',
'Р' => 'R',
'С' => 'S',
'Т' => 'T',
'У' => 'U',
'Ф' => 'F',
'Х' => 'Kh',
'Ц' => 'Ts',
'Ч' => 'Ch',
'Ш' => 'Sh',
'Щ' => 'Stch',
'Ы' => 'I',
'Э' => 'E',
'Ю' => 'Yu',
'Я' => 'Ya'];

function translit(string $slovo, $ABC){
    return strtr($slovo, $ABC);
    }
echo WORD." => ".translit(WORD, $ABC).PHP_EOL; // сомнения в правильности выполнения задания


function translitNew($slovo, $table){
    $out = "";
    $slovoKakMassiv = preg_split("//u", $slovo, -1, PREG_SPLIT_NO_EMPTY);
    foreach ($slovoKakMassiv as $bukva)
        if(isset($table[$bukva])){
            $out = $out.$table[$bukva];
        } else $out = $out.$bukva;
    return $out;
}
echo WORD." => ".translitNew(WORD, $ABC).PHP_EOL;    


// Задание 5. Функция замены пробелов на подчеркивание
function bezProb($predlozh){
    $aWords = explode(' ', $predlozh);
    return implode('_', $aWords);
}

echo WORDS." => ".bezProb(WORDS).PHP_EOL;

?>